[
    {
        "id" : 1,
        "title" : "Booki",
        "description" : "Ce projet consistait à implémenter le frontend d'une agence fictive de location à partir d'une maquette graphique. L'interface du site est responsive pour pouvoir s'adapter aux différentes tailles d'écran, ordinateur, tablette et smartphone. Ce site a été entière codé depuis zéro.",
        "cover" : "booki_cover.png",
        "competences" : [
            "HTML",
            "CSS"
        ] 
    },{
        "id" : 2,
        "title" : "Sophie Bluel",
        "description" : "L'objectif de ce projet était de créer une page web dynamique avec JavaScript pour une architecte d'intérieur fictive. À partir d'une base de code HTML j'ai créé un affichage dynamique des travaux de l'architecte, ainsi que les filtres d'affichage de ces derniers en récupérant toutes ces informations sur une API. J'ai aussi créé une modale pour gérer la création et la suppression de travaux avec l'affichage en temps réel de la photo lors de la création d'un nouveau projet (le chargement de la chargement est aussi soumis à des tests pour vérifier de l'utilisateur envoie bien une image au supporté par le backend.",
        "cover" : "booki_cover.png",
        "competences" : [
            "HTML",
            "CSS",
            "JavaScript"
        ]
    },{
        "id" : 3,
        "title" : "Nina Carducci",
        "description" : "Ce projet est un projet d'optimisation d'un site d'une photographe fictive. Concernant les fonctionnalité, j'ai corrigé le fonctionnement des boutons \"suivant\" et \"précédent\" de la modale de la gallerie ainsi de la couleur du filtre sélectionné sur le site. Le plus gros du travail a été centré autour de l'optimisation des performances du site et sur le S.E.O.. L'objectif était d'optenir une note au minimum de 90/100 en performance, Accessibilité et S.E.O. avec une audit Lighthouse. Après optimisation, l'audit Lighthouse m'a donné les notes de 97 en performances, 100 en accessibilité et 100 en S.E.O.. Pour finir, je me suis occupé du référencement avec les balises metas et Schema.org pour le référencement local. ",
        "cover" : "booki_cover.png",
        "competences" : [
            "Optimisation des performances",
            "Acessibilité",
            "S.E.O.",
            "DevTools",
            "Lighthouse",
            "Schema.org"
        ]
    },{
        "id" : 4,
        "title" : "Kasa",
        "description" : "Ce projet consistait à créer une WebApp pour Kasa, une agence fictive de location d'appartements entre particuliers. Le projet est créé entièrement en React, la navigation est gérée avec React Router, et le style est codé en SASS avec la méthode \"7 in 1\". L'app est responsive et l'affichage des logements est fait de façon dynamique depuis un fichier JSON. La page de logement, lorsqu'un logement est sélectionné, contient une modale qui affiche toutes les photos du logement, et les informations sont transmises à la page grâce à react state avec une redirection avec la page d'erreur en cas d'id incorrect.",
        "cover" : "booki_cover.png",
        "competences" : [
            "React",
            "React Router",
            "HTML",
            "SASS",
            "Méthode \"7 in 1\"",
            "JavaScript"
        ]
    },{
        "id" : 5,
        "title" : "Mon Vieux Grimoire",
        "description" : "\"Mon Vieux Grimoire\" est un site fictif de notation de livres. Dans ce projet j'ai créé une API pour gérer le backend de ce site. Cette API permet de créer un compte, de se connecter, d'avoir accès à tous les livres enregistrés, à une sélection des trois livres les mieux notés et à la note moyenne de chaque livre, d'ajouter, modifier et supprimer des livres et à noter les livres. Toutes les données sont stockées dans une base de données Atlas de MongoDb et les informations de connexion ç cette base de données sont stockées dans un fichier .env du projet pour une question de sécurité (le fichier .env a été ajouté au fichier.gitignore pour qu'il ne soit pas envoyé sur github en cas de push).",
        "cover" : "booki_cover.png",
        "competences" : [
            "JavaScript",
            "Node.js",
            "Express",
            "MongoDb",
            "dotenv",
            "Sharp",
            "Bcrypt",
            "Mudler"
        ]
    }
]